tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "spicetify/tap"
brew "git"
brew "gnu-sed"
brew "go"
brew "micromamba"
brew "neovim"
brew "node"
brew "pngpaste"
brew "python@3.12"
brew "poetry"
brew "ripgrep"
brew "rust"
brew "snakemake"
brew "tmux"
brew "yadm"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
cask "1password"
cask "1password-cli"
cask "curseforge"
cask "docker"
cask "font-fira-code-nerd-font"
cask "julia"
cask "obsidian"
cask "r"
cask "rectangle"
cask "rstudio"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "wezterm-nightly"
cask "zotero"
vscode "adpyke.vscode-sql-formatter"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "kevinrose.vsc-python-indent"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.tensorboard"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "mtxr.sqltools"
vscode "snakemake.snakemake-lang"
vscode "tfehlmann.snakefmt"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
